app/views/includes/_menu.erb

                  <div class="attribute_list">
                    <%= collection_select(:camion, :brand, BrandTruck.order(:name), :link_rewrite, :name, {prompt: 'Todas las marcas'}, :class=>'form-control') %>
---
SELECT `brand_trucks`.* FROM `brand_trucks`   ORDER BY `brand_trucks`.`name` ASC

                  <div class="attribute_list">
                    <%= collection_select(:camion, :state, State.order(:id), :link_rewrite, :name, {prompt: 'Selecciona'}, :class=>'form-control') %>
---
SELECT `states`.* FROM `states`   ORDER BY name ASC, `states`.`id` ASC

                  <div class="attribute_list">
                    <%= collection_select(:servicio, :brand, BrandExtra.order(:id), :link_rewrite, :name, {prompt: 'Selecciona'}, :class=>'form-control') %>
---
SELECT `brand_extras`.* FROM `brand_extras`   ORDER BY `brand_extras`.`id` ASC

                  <div class="attribute_list">
                    <%= collection_select(:servicio, :state, State.order('name ASC'), :link_rewrite, :name, {prompt: 'Selecciona'}, :class=>'form-control') %>
---
SELECT `states`.* FROM `states`   ORDER BY name ASC


                    <%= collection_select(:state, :service, TypeService.order(:id), :link_rewrite, :name, {prompt: 'Selecciona'}, :class=>'form-control') %>
---
SELECT `type_services`.* FROM `type_services`   ORDER BY `type_services`.`id` ASC