app/views/pages/micamiones.html.erb

      <div class="modal-body">
        <%= select("post", "person_id", TypeTruck.all.collect {|p| [ p.name, p.id ] }, {prompt: 'Seleccione Tipo de camion'}, {class:'form-control'}) %>
---
SELECT `type_trucks`.* FROM `type_trucks`