app/views/pages/micuenta.html.erb

SELECT  `offers`.* FROM `offers`  WHERE `offers`.`id` = 1 LIMIT 1
---

   @user.offer.each do |item|

SELECT `offercustomers`.* FROM `offercustomers`  WHERE `offercustomers`.`customer_id` = 1
SELECT `offers`.* FROM `offers` INNER JOIN `offercustomers` ON `offers`.`id` = `offercustomers`.`offer_id` WHERE `offercustomers`.`customer_id` = 1
---

<% if !@user.offercustomers.blank? %>