app/controllers/pages_controller.rb

SELECT `type_services`.* FROM `type_services`   ORDER BY `type_services`.`id` ASC
SELECT `type_trucks`.* FROM `type_trucks`
SELECT `states`.* FROM `states`   ORDER BY name ASC, `states`.`id` ASC
SELECT `brand_trucks`.* FROM `brand_trucks`   ORDER BY `brand_trucks`.`name` ASC
---
  def index
    self.init_toggle #inicia el despliegue de la busqueda anidada
    @search_serv = Service.search(params[:q])
    @search_repu = Extra.search(params[:q])
    @search_cam  = Truck.search(params[:q])
    @states      = State.all.order(:name)
    @types       = TypeTruck.all.includes(:brand_trucks)

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
SELECT `trucks`.* FROM `trucks`  WHERE `trucks`.`customer_id` = 1
SELECT  `brand_trucks`.* FROM `brand_trucks`  WHERE `brand_trucks`.`id` = 15 LIMIT 1
SELECT  `states`.* FROM `states`  WHERE `states`.`id` = 1  ORDER BY name ASC LIMIT 1
SELECT  `type_trucks`.* FROM `type_trucks`  WHERE `type_trucks`.`id` = 5 LIMIT 1
SELECT COUNT(*) FROM `trucks`  WHERE `trucks`.`customer_id` = 1
---
  def micamiones
    if session[:user].nil?
       redirect_to micuenta_path
    else
       @user     = Customer.find_by_id(session[:user])
       @quantity = @user.quantities.first
       @search   = Truck.where(:customer_id => session[:user]).includes(:type_truck, :brand_truck, :state, :messages).search(params[:q])
       @trucks   = @search.result.page(params[:page]).per(Environment::LIMIT_SEARCH)

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
SELECT `extras`.* FROM `extras`  WHERE `extras`.`customer_id` = 1
SELECT  `brand_extras`.* FROM `brand_extras`  WHERE `brand_extras`.`id` = 4 LIMIT 1
SELECT  `type_trucks`.* FROM `type_trucks`  WHERE `type_trucks`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `extras`  WHERE `extras`.`customer_id` = 1
---
  def mirepuestos

    if session[:user].nil?
      redirect_to micuenta_path
    else
      @user     = Customer.find_by_id(session[:user])
      @quantity = @user.quantities.first
      @search   = Extra.where(:customer_id => session[:user]).includes(:type_trucks, :brand_extras, :messages).search(params[:q])
      @extras   = @search.result.page(params[:page]).per(Environment::LIMIT_SEARCH)

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
SELECT `services`.* FROM `services`  WHERE `services`.`customer_id` = 1
SELECT  `type_services`.* FROM `type_services`  WHERE `type_services`.`id` = 4 LIMIT 1
SELECT COUNT(*) FROM `services`  WHERE `services`.`customer_id` = 1
---
  def miservicios

    if session[:user].nil?
      redirect_to micuenta_path
    else
      @user       = Customer.find_by_id(session[:user])
      @quantity   = @user.quantities.first
      @search     = Service.where(:customer_id => session[:user]).includes(:type_services, :messages).search(params[:q])
      @servicios  = @search.result.page(params[:page]).per(Environment::LIMIT_SEARCH)

SELECT `customers`.* FROM `customers`  WHERE (email = 'danielpunk4@gmail.com' and clave = 'danielpunk4@gmail.com')
SELECT COUNT(*) FROM `customers`  WHERE (email = 'danielpunk4@gmail.com' and clave = 'danielpunk4@gmail.com')
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
SELECT `offercustomers`.* FROM `offercustomers`  WHERE `offercustomers`.`customer_id` = 1
---
  def micuenta

      if session[:user].nil?

        @message = false
        if request.post?
           @usuario = Customer.where('email = ? and clave = ?', params[:email], params[:clave])

          if @usuario.count == 0
            @message = true
            flash[:success] = ' Email o Clave invalida'
           else
            session[:user] = @usuario[0].id
          end
          redirect_to micuenta_path
        else
          render :action => 'micuentalogin', :layout => 'layouts/devise'
        end

      else

        @user = Customer.find_by_id(session[:user])
        # se valida si el plan esta inscrito y esta vigente jonathan
        @user_cargar_planes = @user.cargar_planes
        @quantity           =  @user.quantities.first
        flash[:warning]     = "Su plan gratis ha caducado su valides fue de 3 meses el plan fue inscrito el #{@user.created_at.strftime('%d-%m-%Y')}" if @user_cargar_planes == -1
        @offers             = Offercustomer.where(:customer_id => session[:user])